[M_IrisEp3Battle_BarFight MissionDefinition]
MissionDescription="Ankonus betrayed you. He kicked you out of the stadium and everyone thought you ran away because you were a coward..<br><br>Unless a writer wants to be a writer. Tog will tell you there. [place]Ham[-place] You'll find new sponsors there..<br><br>It looks like a warrior named Pyropet kidnapped the guard he was looking for. Sponsors will give it to you, but only if it bothers you. [place]Ham[-place]. <br><br>You have no reason to believe that the promise will be kept, but you know it. Uh-huh."
TeaserText="Pyro killed his friend Pete to retrieve the stolen sponsor.."

[M_IrisEp3Battle_BarFight2 MissionDefinition]
MissionDescription="How many evil barons can you kill in time..<br><br>Level 2 difficulty."

[M_IrisEp3Battle_BarFight3 MissionDefinition]
MissionDescription="Kill as many evil bar dwellers as possible within the time limit.<br><br>Difficulty level 3."

[M_IrisEp3Battle_BarFightR3 MissionDefinition]
MissionDescription="Kill as many evil bar dwellers as possible within the time limit.<br><br>Difficulty level 3."
